---
kind: other
id: AllMembers.T:Autodesk.Revit.DB.Structure.RebarHookType
source: html/c9d03086-c1ac-b486-e1a1-19a4a0398879.htm
---
# RebarHookType Members

Returns true if the properties CreatedPhaseId and DemolishedPhaseId can be modified for this Element.